export const LOCALE_HTML = {
   en: {
    //  меню основное
    home: 'home',
    about: 'about',
     // можно на play
    game: 'game',
    // смена языка   
    eng: 'EN,',
    rus: 'RU',
    // стартовый текст
    start: '',
     // кнопка играть
    play: 'play',
    // промо текст
    promo: '',

    gameplayTitle: 'Gameplay',
    gameplayText: '',

    ratingTitle: 'Rating table',
    ratingText: '',

    scoreTitle: 'Final score',
    scoreText: '',

    enemyTitle: '',
    enemyText: '',

    multyTitle: '',
    multyText: '',

    control: 'Control',
    jump: 'jump',
    left: 'left',
    right: 'right',

    slogan: '',

    aboutTitle: 'About',
    aboutText: '',

    team: 'Team',
    tony: 'Tony Yemelyanov',
    i3: 'Igor Zakharov',
    heliken: 'Filip Bursh',
    mauta: 'Anna Opareva',

    copyright: '',

   },
 
   ru: {
    //  меню основное
    home: 'главная',
    about: 'о проекте',
    // можно на play
    game: 'играть',
    // стартовый текст
    start: 'Клон 2D игры-головоломки, в которую можно играть как в одиночку, так и в паре за одной клавиатурой, или по сети. Финальный проект курса front-end курса <b>RSS</b>',
    // смена языка   
    eng: 'АНГ,',
    rus: 'РУС',
    // кнопка играть
    play: 'играть',
    // промо текст
    promo: 'В ходе прохождения игры игроки столкнутся с живописным миром, взаимодействием двух персонажей, с приятной физикой, включающей головоломки, врагов и даже эксперименты с гравитацией.',
  
    gameplayTitle: 'Геймплей',
    gameplayText: 'Игровой процесс построен на взаимодействии двух главных героев — Ibb и Obb, которые помогая друг другу преодолевать препятствия должны как можно быстрее добраться до конца игры и при этом заработать как можно больше очков.',

    ratingTitle: 'Рейтинговая таблица',
    ratingText: 'Никнеймы игроков с лучшими результатами прохождения игры попадут в глобальную рейтинговую таблицу.',

    scoreTitle: 'Итоговые очки',
    scoreText: 'Игроки набирают очки убивая врагов и собирая кристаллики, которые из них выпадают. Но в глобальную рейтинговую таблицу попадают лишь те, кто наберет максимальное количество очков и за минимальное время прохождения игры.',
  
    enemyTitle: 'Враги и боевая система',
    enemyText: 'Каждый враг в игре обладает двумя сущностями — «лицевой» и «тыльной» лицевая сторона чем-то напоминает ежа, столкнувшись с которой персонажи погибают, и игра завершается. А тыльная сторона, является слабой точкой врагов и при столкновении персонажей с ней, враг погибает, разбрасывая ценные кристаллы.',

    multyTitle: 'Мультиплеер',
    multyText: 'Пройти игру можно в одиночку, играя сразу за обоих игроков со своей клавиатуры. Можно проходить игру с напарником, также с одной клавиатуры. Но можно и создать онлайн сессию, к которой сможет подключиться любой желающий по сети для совместного онлайн прохождения.',

    control: 'Управление',
    jump: 'прыг',
    left: 'влево',
    right: 'вправо',

    slogan: 'Сыграй в нашу версию ibb & obb',

    aboutTitle: 'О проекте',
    aboutText: 'Финальный проект фронтэнд курса RSSchool выполненный в начале 2021. Это командное задание, целью которого является разработка игры, работающей в веб браузере. Выбор самой игры был на усмотрение команды, и мы решили выбрать игру “Ibb & Obb”',
  
    team: 'Team',
    tony: 'Тони Емельянов',
    i3: 'Игорь Захаров',
    heliken: 'Филипп Бурш',
    mauta: 'Анна Опарева',

    copyright: 'Авторские права на большую часть материалов и саму концепцию принадлежат создателям оригинальной игры Ibb & Obb (издатель: Sparpweed, разработчики: Sparpweed, Codeglue)',

  },
 };
 
 export default LOCALE_HTML;